Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/civil_law/court_case.html.txt.tmx
Source language: en
Languages: ga

source: Proceedings in civil court cases
ga: Imeachtaí i gcásanna cúirte sibhialta

source: If your civil court case has not been settled 'out-of-court', it will be set down for trial before a court
ga: Muna bhfuil réiteach faighte ar do chás socrófar dáta don triail ós comhair na cúirte

source: If the defendant in the case has not admitted he/she is at fault, the trial will take the following format;
ga: Muna bhfuil freagracht glactha ag an gcosantóir sa chás, is mar seo a leanas a bheidh an triail;

source: • Your barrister will outline to the judge the nature of the case and the injuries you suffered
ga: • Déanfaidh d'abhcóide cur síos don bhreitheamh ar an gcás agus ar an ngortú a d'fhulaing tú

source: • Medical evidence relating to your injuries may be given by a doctor if appropriate to your case
ga: • Más cuí don chás, is féidir le dochtúir fianaise a chur ar fáil maidir leis an ngortú a d'fhulaing tú

source: • An engineer may be called to give evidence if necessary
ga: • Más gá is féidir innealtóir a ghlaoch le fianaise a thabhairt

source: • You are called to give evidence:
ga: • Glaofar ort féin le fianaise a thabhairt:

source: - This will involve swearing on oath and answering the questions posed to you by your barrister as clearly and concisely as possible
ga: - Beidh ort mionn a thógáil agus ceisteanna a fhreagairt a chuireann d'abhcóide féin chomh soiléar agus chomh beacht agus is féidir leat

source: You will give evidence relating to how the accident occurred and your injuries
ga: Tabharfaidh tú fianaise maidir le cén chaoi ar tharla an timpiste agus an gortú a bhaint duit

source: - When your barrister has finished asking you questions, you will be cross-examined by the barrister on the other side
ga: - Nuair atá na ceisteanna ar fad curtha ag d'abhcóide, déanfaidh abhcóide an taobh eile tú a chroscheistiú

source: The object of cross-examination is to discover the truth so you may be asked questions about inconsistencies in your evidence
ga: Tá sé mar aidhm aige seo teacht ar an bhfírinne agus mar sin cuirfear ceisteanna ort maidir le haon chaoi nach bhfuil do chuid freagraí ag cur lena chéile

source: You may also be told what the defendant or his/her witnesses say is the true version of events and asked to comment on their evidence
ga: D'fhéadfadh sé go n-inseófaí duit an leagan atá ag an gcosantóir nó a f(h)innéithe den fhírinne agus iarrfar ort do bharúil a thabhairt ar a bhfuil le rá acu

source: • All the other witnesses on your side give evidence and are cross-examined
ga: • Tabharfaidh na finnéithe eile ar do thaobh fianaise agus déanfar iad a chroscheistiú

source: • The defendant's witnesses are each called to the witness box and give evidence
ga: • Glaofar ar fhinnéithe an chosantóra le fianaise a thabhairt

source: Your barrister may cross-examine each one of them
ga: Is féidir le d'abhcóide chuile dhuine acu a chroscheistiú

source: • When all the witnesses have been called, both barristers may make submissions to the judge
ga: • Nuair atá gach finné glaoite, is féidir leis na habhcóidí áiteamh a chur faoi bhráid an bhreithimh

source: This may include summarising or emphasising certain evidence or making legal arguments
ga: Is féidir leo achomair a dhéanamh ar an bhfianaise nó pointí de a threisiú nó argóintí dlí a dhéanamh

source: • The judge will make his/her decision on:
ga: • Déanfaidh an breitheamh cinneadh:

source: - Whether the defendant is at fault and therefore liable to pay damages to you,
ga: - An bhfuil an cosantóir ciontach agus mar sin freagrach as damáistí a íoc leat,

source: - The amount of damages to which you are entitled as a result of your injuries and
ga: - Cé mhéid damáistí atá ag dul chugat de bharr an ghortaithe agus

source: - Who shall pay the costs of the proceedings
ga: - Cé a íocfaidh costais an cháis

source: Usually, if you have won the case, the judge will order that the defendant pay your legal costs as well as his/her own
ga: Go hiondúil, má d'éirigh leat, déanfaidh an breitheamh cinneadh gur ceart don chosantóir íoc as do chuid costas chomh maith lena c(h)uid féin

source: If you lose, it is likely you will have to pay the costs of both sides
ga: Muna n-éiríonn leat, is iondúil go mbeidh ortsa íoc as costais an dá thaobh

source: If the defendant admits that he/she is to blame for your injuries and you are not happy with the amount offered in settlement of damages, then the matter will be sent to a court for judgement on the amount of damages you are entitled to
ga: Má admhaíonn cosantóir go bhfuil sé/sí freagrach as do ghortú agus muna bhfuil tú sásta leis na damáistí a thairscíonn sé/sí mar réiteach, cuirfear an cás ós comhair na cúirte le breith a thabhairt ar na damáistí gur cóir duit a fháil

source: In this situation, the court does not consider the question of who is to blame
ga: Sa chás seo, ní bhreathnaíonn an chúirt ar ceist na freagrachta

source: The judge will merely place a value on your case based on an examination of the nature and extent of your injuries and the prognosis for the future
ga: Cuirfidh an breitheamh luach ar do chás bunaithe ar scrúdú ar do ghortú agus tuar leighis don todhchaí

source: This examination will be conducted by considering the available medical reports and/or hearing medical practitioners' evidence relating to your injuries
ga: Déanfar an scrúdú seo tríd na tuairiscí leighis a mheas agus/nó fianaise a chloisteáil ó dhochtúirí a bhaineann le do ghortú

source: You will be called as a witness so that you can describe your injuries
ga: Glaofar ort mar fhinné le cur síos a dhéanamh ar an ngortú a bhain duit

source: When will you receive the award?
ga: Cén uair a gheobhaidh tú na damáistí?

source: Usually awards as a result of civil cases are paid by the defendant to your solicitor within 6 to 8 weeks
ga: Íocann an cosantóir damáistí go hiondúil le do dhlíodóir taobh istigh de 6-8 seachtain
